package code02_reviewJava5;

/**
 * Created with IntelliJ IDEA.
 *
 * @Author: 雪雪子
 * @Date: 2024/04/15/18:36
 * @Description: 复习JavaS 5
 */
public class MainTest {
    public static void main(String[] args) {
        /*1. 写一个父类图形类，其中有方法，功能计算面积为抽象方法。
        * 2. 抽象类继承。判断对错,没错的分析运行结果
        * 3. 发红包,群内用户类作为父类，有收红包方法，群主类作为子类有发红包的方法
① 群主的一笔金额，从群主的余额中扣除，平均分成n等份，让成员领取。
② 成员领取后，保存到成员余额中
优化：③ 该类每自动生成一个对象，就自动赋值id编号，随人数增加
* 1. 写一个实现类D 实现两个接口A,B，继承一个父类C
接口A写所有可有内容（5种）的完整写法
接口B写所有可有内容的省略写法
其中A,B 中1常量名重复，1抽象方法重复， 1抽象方法只方法名,参数相同，1私有方法重复。A,B,C 1默认方法重复,1静态方法重复。B,C 1默认方法重复（分析哪些不能实现及原因）

* 1. 多态中成员方法调用，判断以下输出
* 2. 多态中成员变量，判断对错或结果
* 3. 多态中，成员方法间接访问成员变量。判断对错或结果
* 4. 接口，多态综合练习，接口的基本使用，对象的上下转型，以及接口作为方法的参数。*/

    }
}
